org/jekyll-org.org
# -*-org-*-
#+STARTUP: odd
#+OPTIONS: toc:2
#+LINK: google http://www.google.com/search?q=%s
#+LINK: rfc http://www.rfc-editor.org/rfc/rfc%s.txt
#+LINK: redis http://redis.io/commands/%s
#+TODO: TODO(t) | DONE(d) CANCELED(c) POSTPONED
#+DRAWERS: PROPERTIES CLOCK LOGBOOK COMMENT
#+TITLE: Jekyll with org-mode and twitter bootstrap
#+AUTHOR: Seong-Kook Shin
#+EMAIL: cinsky@gmail.com
#+BEGIN_HTML
---
layout: org
id: jekyll-org
title: Jekyll with org-mode and twitter bootstrap
---
#+END_HTML
:COMMENT:
# Markup hints:
#   *bold*, /italic/, _underlined_, =code=, ~verbatim~
#   Use '\\' at the end of a line to force a line break.
#   Use "[[URL or TARGET][NAME]]" to create a hyperlink.
#   Use "[[google:KEYWORD][DESC]]" to link to Google with KEYWORD.
#   Use "[[rfc:NUMBER][DESC]]" to link to RFC-NUMBER.txt.
#   `C-c C-o' to follow a link target.
#   Use "#+BEGIN_VERSE ... #+END_VERBSE" to format poetry
#   Use "#+BEGIN_QUOTE ... #+END_QUOTE" to format a quotation.
#   Use "#+BEGIN_CENTER ... #+END_CENTER" to center some text.
#   `C-c C-x f' for footnote action(jump or insert).
#   Unordered list items start with `-', `+', or `*' as bulllets.
#   Ordered list items start with  `1.' or `1)'.
:END:

* Introduction
  This document describes how to integrate your articles (in Emacs
  [[http://orgmode.org][org-mode]] format) into [[http://jekyllrb.com/][jekyll]] based HTML site with 
  [[http://twitter.github.com/bootstrap/scaffolding.html][twitter bootstrap scaffolding]] style.

  Note that this article is heavily influenced by [[http://orgmode.org/worg/org-tutorials/org-jekyll.html][Using org to Blog
  with Jekyll]].

* Document structure

#+BEGIN_SRC text
.
├── _plugins          # custom Jekyll/Liquid plugins
├── org               # Your org files should be placed here
├── src               # Jekyll source directory
│   ├── _layouts
│   └── articles      # org generated html files are installed here
└── www               # Jekyll destination directory
    └── articles      # final destination of your .org based html files
#+END_SRC


* Usage
  
  All your =.org= files should be located in =org/= directory.

  Since, jekyll requires that all source files that 
  Your =.org= file should have following header.
#+BEGIN_HTML
<pre>#+BEGIN_HTML
---
layout: org
title: Jekyll with org-mode and twitter bootstrap
---
⁠#+END_HTML</pre>
#+END_HTML

*** Tested Platform

***** Gentoo Linux
      - GNU Emacs 24.2.1 (Gentoo package: app-editors/emacs-23)

      - org-mode version 7.9.3d (package.el: org 20130114) or,

***** Mac (Darwin)
      - GNU Emacs 24.2 (from [[http://emacsformacosx.com/][here]])

      - org-mode version 7.9.1 (package.el: org 201209003)

      - Gentoo Linux: GNU Emacs 23.2.1, org-mode version 7.9.3d
      - MacOSX (darwin) 10.8.2: 
*** Configuration
    You *MUST* change the value of some keys in =_config.yml=, especially
    for =bootstrap=, =prettify=, and =jquery=.

#+BEGIN_SRC yaml
bootstrap: "http://some.place.com/bootstrap"
prettify: "http://some.place.com/bootstrap"
jquery: "http://some.place.com/bootstrap/js/jquery.js"
#+END_SRC

    You may need to modify both =src/_layouts/default.html= and
    =src/_layouts/org.html= to reflect the above configuration.  For example,
    =default.html= contains a HTML tags such as:

#+BEGIN_SRC html
<link href="http://some.place.com/bootstrap/css/bootstrap.css" rel="stylesheet"/>
<link href="http://some.place.com/bootstrap/css/bootstrap-responsive.css"
      rel="stylesheet"/>
<link href="http://some.place.com/bootstrap/css/docs.css" rel="stylesheet"/>
<link href="http://some.place.com/prettify.css" rel="stylesheet"/>
...
<script src="http://some.place.com/bootstrap/js/jquery.js"></script>
#+END_SRC

    To use make(1) to build your html generation, the jekyll should
    not create HTTP server; make sure that you have "=auto=false=".

    To use org-specific Jekyll plugins, make sure that you have
    "=safe=false=".

