articles/jekyll-org.html
<!DOCTYPE html>
<html lang="en">
  <head>
    <meta charset="utf-8"/>
    <meta name="viewport" content="width=device-width, initial-scale=1.0"/>
    <meta name="description" content=""/>
    <meta name="author" content=""/>

    <title>Jekyll with org-mode and twitter bootstrap</title>

    <!-- Le styles -->
    <link href="http://www.cinsk.org/bootstrap/css/bootstrap.css" rel="stylesheet"/>
    <link href="http://www.cinsk.org/bootstrap/css/bootstrap-responsive.css"
          rel="stylesheet"/>
    <link href="http://www.cinsk.org/bootstrap/css/docs.css" rel="stylesheet"/>
    <link href="http://www.cinsk.org/bootstrap/prettify.css" rel="stylesheet"/>

    <!-- Le HTML5 shim, for IE6-8 support of HTML5 elements -->
    <!--[if lt IE 9]>
    <![endif]-->

    <!-- Le fav and touch icons -->
    <link rel="apple-touch-icon-precomposed" sizes="144x144"
          href="http://www.cinsk.org/bootstrap/ico/apple-touch-icon-144-precomposed.png"/>
    <link rel="apple-touch-icon-precomposed" sizes="114x114"
          href="http://www.cinsk.org/bootstrap/ico/apple-touch-icon-114-precomposed.png"/>
    <link rel="apple-touch-icon-precomposed" sizes="72x72"
          href="http://www.cinsk.org/bootstrap/ico/apple-touch-icon-72-precomposed.png"/>
    <link rel="apple-touch-icon-precomposed"
          href="http://www.cinsk.org/bootstrap/ico/apple-touch-icon-57-precomposed.png"/>
    <link rel="shortcut icon" href="http://www.cinsk.org/bootstrap/ico/favicon.png"/>

    <link href="../css/org.css" rel="stylesheet"/>
  </head>

  <body data-spy="scroll" data-target=".bs-docs-sidebar">
    <!-- Navbar
         ================================================== -->
    <div class="navbar navbar-inverse navbar-fixed-top">
      <div class="navbar-inner">
        <div class="container">
          <button type="button" class="btn btn-navbar"
                  data-toggle="collapse" data-target=".nav-collapse">
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
          </button>
          <a class="brand" href="./index.html">Jekyll-Org</a>
          <div class="nav-collapse collapse">
            <ul class="nav">
              
              
              <li class=""><a href="../index.html">Home</a></li>
              
              
              
              <li class="active"><a href="../articles.html">Articles</a></li>
              
              
              
              <li class=""><a href="../dir1/index.html">Page 1</a></li>
              
              
              
              <li class=""><a href="../dir2/index.html">Page 2</a></li>
              
              
              <!--
              
              -->
            </ul>
          </div>
        </div>
      </div>
    </div>

    <!-- Subhead
         ================================================== -->
    <header class="jumbotron subhead" id="overview">
      <div class="container">
        <h1>Jekyll with org-mode and twitter bootstrap</h1>
        <p class="lead"></p>
      </div>
    </header>

    <div class="container">

      <div class="row">
        <div class="span3 bs-doc-sidebar">
          <ul class="nav nav-list bs-docs-sidenav">
            
            <li><a href="#sec-1"><i class="icon-chevron-right"></i>
            1 Introduction</a></li>
            
            <li><a href="#sec-2"><i class="icon-chevron-right"></i>
            2 Document structure</a></li>
            
            <li><a href="#sec-3"><i class="icon-chevron-right"></i>
            3 Usage</a></li>
            
            <li><a href="#sec-4"><i class="icon-chevron-right"></i>
            4 Implementation</a></li>
            

            <!--
            
            
            
            
            
            
            
            
            
            -->
          </ul>
        </div>

        <div class="span9">
          <div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Introduction</a></li>
<li><a href="#sec-2">2 Document structure</a></li>
<li><a href="#sec-3">3 Usage</a>
<ul>
<li><a href="#sec-3-1">3.1 Tested Platform</a></li>
<li><a href="#sec-3-2">3.2 Configuration</a></li>
<li><a href="#sec-3-3">3.3 Page format</a></li>
<li><a href="#sec-3-4">3.4 Additional Plug-ins</a></li>
<li><a href="#sec-3-5">3.5 Troubleshootings</a></li>
</ul>
</li>
<li><a href="#sec-4">4 Implementation</a>
<ul>
<li><a href="#sec-4-1">4.1 Table of Content(TOC) Generation</a></li>
</ul>
</li>
</ul>
</div>
</div>
<section id="sec-1">
<div id="outline-container-1">
<div class="page-header">
<h1>Introduction</h1>
</div>
</div>
<div class="outline-text-2" id="text-1">

<p>  This document describes how to integrate your articles (in Emacs
  <a href="http://orgmode.org">org-mode</a> format) into <a href="http://jekyllrb.com/">jekyll</a> based HTML site with 
  <a href="http://twitter.github.com/bootstrap/scaffolding.html">twitter bootstrap scaffolding</a> style.
</p>
<p>
  Note that this article is heavily influenced by <a href="http://orgmode.org/worg/org-tutorials/org-jekyll.html">Using org to Blog with Jekyll</a>.
</p>
</div>

</section>
<section id="sec-2">
<div id="outline-container-2">
<div class="page-header">
<h1>Document structure</h1>
</div>
</div>
<div class="outline-text-2" id="text-2">





<pre class="src src-text">.
├── _plugins          # custom Jekyll/Liquid plugins
├── org               # Your org files should be placed here
├── src               # Jekyll source directory
│   ├── _layouts
│   └── articles      # org generated html files are installed here
└── www               # Jekyll destination directory
    └── articles      # final destination of your .org based html files
</pre>



</div>

</section>
<section id="sec-3">
<div id="outline-container-3">
<div class="page-header">
<h1>Usage</h1>
</div>
</div>
<div class="outline-text-2" id="text-3">


<p>  
  All your <code>.org</code> files should be located in <code>org/</code> directory.
</p>
<p>
  Since, jekyll requires that all source files that 
  Your <code>.org</code> file should have following header.
<pre>#+BEGIN_HTML
---
layout: org
title: Jekyll with org-mode and twitter bootstrap
---
⁠#+END_HTML</pre>

</p>
</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1">Tested Platform</h3>
<div class="outline-text-3" id="text-3-1">



</div>

<div id="outline-container-3-1-1" class="outline-4">
<h4 id="sec-3-1-1">Gentoo Linux</h4>
<div class="outline-text-4" id="text-3-1-1">

<ul>
<li>GNU Emacs 24.2.1 (Gentoo package: app-editors/emacs-23)

</li>
<li>org-mode version 7.9.3d (package.el: org 20130114) or,
</li>
</ul>


</div>

</div>

<div id="outline-container-3-1-2" class="outline-4">
<h4 id="sec-3-1-2">Mac (Darwin)</h4>
<div class="outline-text-4" id="text-3-1-2">

<ul>
<li>GNU Emacs 24.2 (from <a href="http://emacsformacosx.com/">here</a>)

</li>
<li>org-mode version 7.9.1 (package.el: org 201209003)

</li>
<li>Gentoo Linux: GNU Emacs 23.2.1, org-mode version 7.9.3d
</li>
<li>MacOSX (darwin) 10.8.2: 
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2">Configuration</h3>
<div class="outline-text-3" id="text-3-2">

<p>    You <b>MUST</b> change the value of some keys in <code>_config.yml</code>, especially
    for <code>bootstrap</code>, <code>prettify</code>, and <code>jquery</code>.
</p>



<pre class="src src-yaml">bootstrap: <span class="org-string">"http://some.place.com/bootstrap"</span>
prettify: <span class="org-string">"http://some.place.com/bootstrap"</span>
jquery: <span class="org-string">"http://some.place.com/bootstrap/js/jquery.js"</span>
</pre>


<p>
    You may need to modify both <code>src/_layouts/default.html</code> and
    <code>src/_layouts/org.html</code> to reflect the above configuration.  For example,
    <code>default.html</code> contains a HTML tags such as:
</p>



<pre class="src src-html">&lt;<span class="org-function-name">link</span> <span class="org-variable-name">href</span>=<span class="org-string">"http://some.place.com/bootstrap/css/bootstrap.css"</span> <span class="org-variable-name">rel</span>=<span class="org-string">"stylesheet"</span>/&gt;
&lt;<span class="org-function-name">link</span> <span class="org-variable-name">href</span>=<span class="org-string">"http://some.place.com/bootstrap/css/bootstrap-responsive.css"</span>
      <span class="org-variable-name">rel</span>=<span class="org-string">"stylesheet"</span>/&gt;
&lt;<span class="org-function-name">link</span> <span class="org-variable-name">href</span>=<span class="org-string">"http://some.place.com/bootstrap/css/docs.css"</span> <span class="org-variable-name">rel</span>=<span class="org-string">"stylesheet"</span>/&gt;
&lt;<span class="org-function-name">link</span> <span class="org-variable-name">href</span>=<span class="org-string">"http://some.place.com/prettify.css"</span> <span class="org-variable-name">rel</span>=<span class="org-string">"stylesheet"</span>/&gt;
...
&lt;<span class="org-function-name">script</span> <span class="org-variable-name">src</span>=<span class="org-string">"http://some.place.com/bootstrap/js/jquery.js"</span>&gt;&lt;/<span class="org-function-name">script</span>&gt;
</pre>


<p>
    To use make(1) to build your html generation, the jekyll should
    not create HTTP server; make sure that you have "<code>auto=false</code>".
</p>
<p>
    To use org-specific Jekyll plugins, make sure that you have
    "<code>safe=false</code>".
</p>
</div>

</div>
