org/jekyll-org.org
*** Page format

    To use custom plug-ins provided in this package, you may need to provide
    several custom variable in the YAML front matter of each page.

    To work with =jekyll-org=, it is recommended you provide following
    variables:

    - =id=: id of the page,  this will be used as the internal identification
      of the page content.   Note that if there are multiple pages written
      in several languages and their contents are the same, the =id= of these
      pages should be the same. (mandatory)
    - =label=: short name of the page, which may be used as the text of
      some hyperlinks.  If omitted, the page =id= will be used
      for =label= value. (optional)
    - =title=: title(full name) of the page, which will be used as the
      text of some hyperlinks. (mandatory)
    - =lead=: descriptive sentence to describe the purpose of the page.
      (optional)
    - =lang=: mnemonic of the page locale.  You can omit this
      variable, if the page is in the your primary language.  In this
      case, =jekyll-org= will treat the page locale to '=en='
      (English).

    So, the full example of the YAML front matter will look like:

#+BEGIN_SRC yaml
---
layout: default
title: Jekyll with Org-mode
label: Home
id: home
lead: static site generated by Jekyll, with org-mode articles
---
#+END_SRC


*** Additional Plug-ins
***** 'toplink' block
      To help generating top-level page index, =jekyll-org= provides
      =toplink= block.  =toplink= block will uses the list of page
      IDs, evaulating the contents in the block multiple times
      according to the number of elements in =topnav-list= of the
      =_config.yml= as in the following:

#+BEGIN_SRC yaml
topnav-list: [ "home", "article", "pg1", "pg2" ]
#+END_SRC

      =toplink= tag accepts five parameters separated by
      comma('=,=') character.  For example:

#+BEGIN_HTML
{% raw %}
#+END_HTML
#+BEGIN_SRC html
{% toplink id, label, locale, url, self %}
  ...
{% endtoplink %}
#+END_SRC
#+BEGIN_HTML
{% endraw %}
#+END_HTML

      Each parameter name will turn to the variable name which can be
      used in the =toplink= block.  The meaning of the variables are:

      - 1st parameter (id): id of the page; this is the analogous to
        the each element in =topnav-list=.
      - 2nd parameter (label): label of the page; which can be used
        as the short name of the page.
      - 3rd parameter (locale): mnemonic of the page locale such as
        'en' for English, 'ko' for Korean.  If the locale of the
        evaluating page is the same as the current page, this will be
        an empty string (=""=).
      - 4th parameter (url): URL of the page
      - 5th parameter (self): =true= if the current page is the same
        as the evaluating page.

      For example, if you want to create hyperlinks to the top-level
      pages, you can do this by:

#+BEGIN_HTML
{% raw %}
#+END_HTML
#+BEGIN_SRC html
<ul>
{% toplink id, label, locale, url, self %}
  <li><a href="{{url}}">{{label}}</a></li>
{% endtoplink %}
</ul>
#+END_SRC
#+BEGIN_HTML
{% endraw %}
#+END_HTML

      If you want to remove the hyperlink for the current page, among
      evaluating pages, you can check the 5th parameter as in the
      following:

#+BEGIN_HTML
{% raw %}
#+END_HTML
#+BEGIN_SRC html
<ul>
{% toplink id, label, locale, url, self %}
  {% if self == true %}
  <li>{{label}}</li>
  {% else %}
  <li><a href="{{url}}">{{label}}</a></li>
  {% endif %}
{% endtoplink %}
</ul>
#+END_SRC
#+BEGIN_HTML
{% endraw %}
#+END_HTML

***** 'articles' block

      =articles= block can enumerate pages which has a specified
      layouts.

      =articles= block will be evaluated multiple times for each 
      article.  The usage is almost the same as =toplink= block.

      =articles= will accept four parameters, and each meaning of the
      parameter is:

      - 1st parameter (layouts): a name of the variable in =_config.yml=
        where its value is a list of layout names.
      - 2nd parameter (id): id of the article page
      - 3rd parameter (title): title of the article page.
      - 4th parameter (lead): short description of the article page.
      - 5th parameter (url): URL of the article page
      - 6th parameter (lang): name of the locale of the article page.
        (such as "English" or "Korean")  If the locale of the current
        page is the same as the evaluating article page, this will be
        an empty string (=""=).

      For example, suppose that you have pages in either "my_article1" layout
      or "my_article2" layout.   To enumerate these pages, you need to specify
      the list of layouts in =_config.yml= like:

#+BEGIN_SRC yaml
article_layouts: [ "my_article1", "my_article2" ]
#+END_SRC

      Then, you can enumerate these pages with =article= block like:

#+BEGIN_HTML
{% raw %}
#+END_HTML
#+BEGIN_SRC html
<ul>
  {% articles article_layouts, id, title, lead, url, lang %}
    {% if lang == "" %}
  <li><a href="{{url}}">{{title}}</a></li>
    {% else %}
  <li><a href="{{url}}">{{title}}</a> ({{lang}}) </li>
    {% endif %}
  {% endarticles %}
</ul>
#+END_SRC html
#+BEGIN_HTML
{% endraw %}
#+END_HTML

      Or, if you want to insert 'lead' value, use the following:

#+BEGIN_HTML
{% raw %}
#+END_HTML
#+BEGIN_SRC html
<ul>
  {% articles article_layouts, id, title, lead, url, lang %}
    {% if lead == nil or lead == "" %}
      {% assign leadsep = '' %}
    {% else %} 
      {% assign leadsep = ': ' %}
    {% endif %}

    {% if lang == "" %}
  <li><a href="{{url}}">{{title}}</a>{{leadsep}}{{lead}}</li>
    {% else %}
  <li><a href="{{url}}">{{title}}</a> ({{lang}}){{leadsep}}{{lead}}</li>
    {% endif %}
  {% endarticles %}
</ul>
#+END_SRC html
#+BEGIN_HTML
{% endraw %}
#+END_HTML

*** Troubleshootings
