articles/jekyll-org.html

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3">Page format</h3>
<div class="outline-text-3" id="text-3-3">


<p>
    To use custom plug-ins provided in this package, you may need to provide
    several custom variable in the YAML front matter of each page.
</p>
<p>
    To work with <code>jekyll-org</code>, it is recommended you provide following
    variables:
</p>
<ul>
<li><code>id</code>: id of the page,  this will be used as the internal identification
      of the page content.   Note that if there are multiple pages written
      in several languages and their contents are the same, the <code>id</code> of these
      pages should be the same. (mandatory)
</li>
<li><code>label</code>: short name of the page, which may be used as the text of
      some hyperlinks.  If omitted, the page <code>id</code> will be used
      for <code>label</code> value. (optional)
</li>
<li><code>title</code>: title(full name) of the page, which will be used as the
      text of some hyperlinks. (mandatory)
</li>
<li><code>lead</code>: descriptive sentence to describe the purpose of the page.
      (optional)
</li>
<li><code>lang</code>: mnemonic of the page locale.  You can omit this
      variable, if the page is in the your primary language.  In this
      case, <code>jekyll-org</code> will treat the page locale to '<code>en</code>'
      (English).
</li>
</ul>


<p>
    So, the full example of the YAML front matter will look like:
</p>



<pre class="src src-yaml">---
layout: default
title: Jekyll with Org-mode
label: Home
id: home
lead: static site generated by Jekyll, with org-mode articles
---
</pre>



</div>

</div>

<div id="outline-container-3-4" class="outline-3">
<h3 id="sec-3-4">Additional Plug-ins</h3>
<div class="outline-text-3" id="text-3-4">


</div>

<div id="outline-container-3-4-1" class="outline-4">
<h4 id="sec-3-4-1">'toplink' block</h4>
<div class="outline-text-4" id="text-3-4-1">

<p>      To help generating top-level page index, <code>jekyll-org</code> provides
      <code>toplink</code> block.  <code>toplink</code> block will uses the list of page
      IDs, evaulating the contents in the block multiple times
      according to the number of elements in <code>topnav-list</code> of the
      <code>_config.yml</code> as in the following:
</p>



<pre class="src src-yaml">topnav-list: [ <span class="org-string">"home"</span>, <span class="org-string">"article"</span>, <span class="org-string">"pg1"</span>, <span class="org-string">"pg2"</span> ]
</pre>


<p>
      <code>toplink</code> tag accepts five parameters separated by
      comma('=,=') character.  For example:
</p>




<pre class="src src-html">{% toplink id, label, locale, url, self %}
  ...
{% endtoplink %}
</pre>



<p>
      Each parameter name will turn to the variable name which can be
      used in the <code>toplink</code> block.  The meaning of the variables are:
</p>
<ul>
<li>1st parameter (id): id of the page; this is the analogous to
        the each element in <code>topnav-list</code>.
</li>
<li>2nd parameter (label): label of the page; which can be used
        as the short name of the page.
</li>
<li>3rd parameter (locale): mnemonic of the page locale such as
        'en' for English, 'ko' for Korean.  If the locale of the
        evaluating page is the same as the current page, this will be
        an empty string (=""=).
</li>
<li>4th parameter (url): URL of the page
</li>
<li>5th parameter (self): <code>true</code> if the current page is the same
        as the evaluating page.
</li>
</ul>


<p>
      For example, if you want to create hyperlinks to the top-level
      pages, you can do this by:
</p>




<pre class="src src-html">&lt;<span class="org-function-name">ul</span>&gt;
{% toplink id, label, locale, url, self %}
  &lt;<span class="org-function-name">li</span>&gt;&lt;<span class="org-function-name">a</span> <span class="org-variable-name">href</span>=<span class="org-string">"{{url}}"</span>&gt;{{label}}&lt;/<span class="org-function-name">a</span>&gt;&lt;/<span class="org-function-name">li</span>&gt;
{% endtoplink %}
&lt;/<span class="org-function-name">ul</span>&gt;
</pre>



<p>
      If you want to remove the hyperlink for the current page, among
      evaluating pages, you can check the 5th parameter as in the
      following:
</p>




<pre class="src src-html">&lt;<span class="org-function-name">ul</span>&gt;
{% toplink id, label, locale, url, self %}
  {% if self == true %}
  &lt;<span class="org-function-name">li</span>&gt;{{label}}&lt;/<span class="org-function-name">li</span>&gt;
  {% else %}
  &lt;<span class="org-function-name">li</span>&gt;&lt;<span class="org-function-name">a</span> <span class="org-variable-name">href</span>=<span class="org-string">"{{url}}"</span>&gt;{{label}}&lt;/<span class="org-function-name">a</span>&gt;&lt;/<span class="org-function-name">li</span>&gt;
  {% endif %}
{% endtoplink %}
&lt;/<span class="org-function-name">ul</span>&gt;
</pre>



</div>

</div>

<div id="outline-container-3-4-2" class="outline-4">
<h4 id="sec-3-4-2">'articles' block</h4>
<div class="outline-text-4" id="text-3-4-2">


<p>
      <code>articles</code> block can enumerate pages which has a specified
      layouts.
</p>
<p>
      <code>articles</code> block will be evaluated multiple times for each 
      article.  The usage is almost the same as <code>toplink</code> block.
</p>
<p>
      <code>articles</code> will accept four parameters, and each meaning of the
      parameter is:
</p>
<ul>
<li>1st parameter (layouts): a name of the variable in <code>_config.yml</code>
        where its value is a list of layout names.
</li>
<li>2nd parameter (id): id of the article page
</li>
<li>3rd parameter (title): title of the article page.
</li>
<li>4th parameter (lead): short description of the article page.
</li>
<li>5th parameter (url): URL of the article page
</li>
<li>6th parameter (lang): name of the locale of the article page.
        (such as "English" or "Korean")  If the locale of the current
        page is the same as the evaluating article page, this will be
        an empty string (=""=).
</li>
</ul>


<p>
      For example, suppose that you have pages in either "my_article1" layout
      or "my_article2" layout.   To enumerate these pages, you need to specify
      the list of layouts in <code>_config.yml</code> like:
</p>



<pre class="src src-yaml">article_layouts: [ <span class="org-string">"my_article1"</span>, <span class="org-string">"my_article2"</span> ]
</pre>


<p>
      Then, you can enumerate these pages with <code>article</code> block like:
</p>




<pre class="src src-html">&lt;<span class="org-function-name">ul</span>&gt;
  {% articles article_layouts, id, title, lead, url, lang %}
    {% if lang == <span class="org-string">""</span> %}
  &lt;<span class="org-function-name">li</span>&gt;&lt;<span class="org-function-name">a</span> <span class="org-variable-name">href</span>=<span class="org-string">"{{url}}"</span>&gt;{{title}}&lt;/<span class="org-function-name">a</span>&gt;&lt;/<span class="org-function-name">li</span>&gt;
    {% else %}
  &lt;<span class="org-function-name">li</span>&gt;&lt;<span class="org-function-name">a</span> <span class="org-variable-name">href</span>=<span class="org-string">"{{url}}"</span>&gt;{{title}}&lt;/<span class="org-function-name">a</span>&gt; ({{lang}}) &lt;/<span class="org-function-name">li</span>&gt;
    {% endif %}
  {% endarticles %}
&lt;/<span class="org-function-name">ul</span>&gt;
</pre>



<p>
      Or, if you want to insert 'lead' value, use the following:
</p>




<pre class="src src-html">&lt;<span class="org-function-name">ul</span>&gt;
  {% articles article_layouts, id, title, lead, url, lang %}
    {% if lead == nil or lead == <span class="org-string">""</span> %}
      {% assign leadsep = '' %}
    {% else %} 
      {% assign leadsep = ': ' %}
    {% endif %}

    {% if lang == <span class="org-string">""</span> %}
  &lt;<span class="org-function-name">li</span>&gt;&lt;<span class="org-function-name">a</span> <span class="org-variable-name">href</span>=<span class="org-string">"{{url}}"</span>&gt;{{title}}&lt;/<span class="org-function-name">a</span>&gt;{{leadsep}}{{lead}}&lt;/<span class="org-function-name">li</span>&gt;
    {% else %}
  &lt;<span class="org-function-name">li</span>&gt;&lt;<span class="org-function-name">a</span> <span class="org-variable-name">href</span>=<span class="org-string">"{{url}}"</span>&gt;{{title}}&lt;/<span class="org-function-name">a</span>&gt; ({{lang}}){{leadsep}}{{lead}}&lt;/<span class="org-function-name">li</span>&gt;
    {% endif %}
  {% endarticles %}
&lt;/<span class="org-function-name">ul</span>&gt;
</pre>



</div>
</div>

</div>
