org/jekyll-org.org
***** I got additional list bullets on Table of Contents!

      You may have some problem on the generated table of contents, which
      looks like following:

#+BEGIN_HTML
<div id="text-table-of-contents">
<ul>
<li>1 Introduction</li>
<li>2 Document structure</li>
<li>3 Usage
<ul>
<li>
<ul>
<li>3.1 Troubleshootings</li>
</ul></li>
</ul>
</li>
<li>4 Implementation
<ul>
<li>
<ul>
<li>4.1 Table of Content(TOC) Generation</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
#+END_HTML

      The problem is that, your Emacs scripts set
      =org-odd-levels-only= to =t=, but the batch script, =publish.el=
      in the package, does not aware of it.  To work around this, 
      add "=odd=" in the =STARTUP= keyword.

#+BEGIN_SRC org
#+STARTUP: odd
#+END_SRC

***** I got an error, Symbol's function definition is void: org-version
      Your Emacs uses out-dated org-version probably 6.x.  Install
      recent org-mode.

* Implementation
*** Table of Content(TOC) Generation
    At first, to convert org files into twitter's /scaffolding/ style, 
    I need a way to generate first-level headings into /scaffolding/ way.
    
    However, to parse org file directly to gereate /scaffolding/ TOC
    is somewhat difficult to implement; I briefly overlooked
    =org-html.el= in org-mode, which is fairly complicated.

    Since this is just my hobby to publish my own site, I decieded to
    make a Jekyll/Liquid plugin, that parses the HTML (which org-mode
    exported) to get the first-level headings, and use Liquid markup
    to generate /scaffolding/ TOC.

    Thankfully, org-mode HTML output is fairly simple.  Here are an
    example of HTML that org-mode generated:


#+BEGIN_SRC html
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Introduction</a>
<ul>
<li><a href="#sec-1-1">1.1 Conventions in this article</a></li>
<li><a href="#id-core">1.2 ID management</a></li>
</ul>
</li>
<li><a href="#sec-2">2 Service Components Layout</a>
<ul>
<li><a href="#sec-2-1">2.1 Permanent Cluster</a></li>
<li><a href="#sec-2-2">2.2 Caching Cluster</a></li>
</ul>
</ul>
</div>
</div>
#+END_SRC

    As you can see, all hyperlink IDs are in the form of =sec-N-M=, so
    it can be easily extracted with the following regular expression:

#+BEGIN_SRC ruby
    /^ *<li> *<a +href *= *"(#sec-[0-9]+)" *>(.*?)<\/a>/
#+END_SRC

    So, I made a /Jekyll/ plugin, which parses the org-generated HTML file,
    and put the metadata of the each top-level headings in the /Jekyll/ context,
    so that the /Jekyll/ layout pages can take benefits from the context:

#+BEGIN_SRC ruby
module Jekyll
  class OrgToc < Liquid::Block
    ...
    def render(context)
      contents = context['page']['content']

      thetoc = []

      contents.each_line { |line|
        m = /^ *<li> *<a +href *= *"(#sec-[0-9]+)" *>(.*?)<\/a>/.match line
        if m
          thetoc.push( { "id" => m[1], "title" => m[2] })
        end

        break if / *<div +id *= *"outline-container-[0-9]+\"/.match line
      }

      context['page']['orgtoc'] = thetoc

      super
    end
    ...
  end
end

Liquid::Template.register_tag('orgtoc', Jekyll::OrgToc)
#+END_SRC

    Then, the /Jekyll/ layout for org HTML files will uses =page.orgtoc= to
    generate /scaffolding/ TOC:

#+BEGIN_HTML
{% raw %}
#+END_HTML

#+BEGIN_SRC html
<div class="span3 bs-doc-sidebar">
  <ul class="nav nav-list bs-docs-sidenav">
  {% orgtoc %}
    {% for item in page.orgtoc %}
      <li><a href="{{item.id}}"><i class="icon-chevron-right"></i>
      {{ item.title }}</a></li>
    {% endfor %}
  {% endorgtoc %}
  </ul>
</div>
#+END_SRC

#+BEGIN_HTML
{% endraw %}
#+END_HTML

