articles/jekyll-org.html

<div id="outline-container-3-5" class="outline-3">
<h3 id="sec-3-5">Troubleshootings</h3>
<div class="outline-text-3" id="text-3-5">


</div>

<div id="outline-container-3-5-1" class="outline-4">
<h4 id="sec-3-5-1">I got additional list bullets on Table of Contents!</h4>
<div class="outline-text-4" id="text-3-5-1">


<p>
      You may have some problem on the generated table of contents, which
      looks like following:
</p>


<div id="text-table-of-contents">
<ul>
<li>1 Introduction</li>
<li>2 Document structure</li>
<li>3 Usage
<ul>
<li>
<ul>
<li>3.1 Troubleshootings</li>
</ul></li>
</ul>
</li>
<li>4 Implementation
<ul>
<li>
<ul>
<li>4.1 Table of Content(TOC) Generation</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>

<p>
      The problem is that, your Emacs scripts set
      <code>org-odd-levels-only</code> to <code>t</code>, but the batch script, <code>publish.el</code>
      in the package, does not aware of it.  To work around this, 
      add "<code>odd</code>" in the <code>STARTUP</code> keyword.
</p>



<pre class="src src-org"><span class="org-org-meta-line">#+STARTUP: odd</span>
</pre>


</div>

</div>

<div id="outline-container-3-5-2" class="outline-4">
<h4 id="sec-3-5-2">I got an error, Symbol's function definition is void: org-version</h4>
<div class="outline-text-4" id="text-3-5-2">

<p>      Your Emacs uses out-dated org-version probably 6.x.  Install
      recent org-mode.
</p>
</div>
</div>
</div>

</section>
<section id="sec-4">
<div id="outline-container-4">
<div class="page-header">
<h1>Implementation</h1>
</div>
</div>
<div class="outline-text-2" id="text-4">


</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1">Table of Content(TOC) Generation</h3>
<div class="outline-text-3" id="text-4-1">

<p>    At first, to convert org files into twitter's <i>scaffolding</i> style, 
    I need a way to generate first-level headings into <i>scaffolding</i> way.
</p>
<p>    
    However, to parse org file directly to gereate <i>scaffolding</i> TOC
    is somewhat difficult to implement; I briefly overlooked
    <code>org-html.el</code> in org-mode, which is fairly complicated.
</p>
<p>
    Since this is just my hobby to publish my own site, I decieded to
    make a Jekyll/Liquid plugin, that parses the HTML (which org-mode
    exported) to get the first-level headings, and use Liquid markup
    to generate <i>scaffolding</i> TOC.
</p>
<p>
    Thankfully, org-mode HTML output is fairly simple.  Here are an
    example of HTML that org-mode generated:
</p>




<pre class="src src-html">&lt;<span class="org-function-name">div</span> <span class="org-variable-name">id</span>=<span class="org-string">"table-of-contents"</span>&gt;
&lt;<span class="org-function-name">h2</span>&gt;<span class="org-underline"><span class="org-bold-italic">Table of Contents</span></span>&lt;/<span class="org-function-name">h2</span>&gt;
&lt;<span class="org-function-name">div</span> <span class="org-variable-name">id</span>=<span class="org-string">"text-table-of-contents"</span>&gt;
&lt;<span class="org-function-name">ul</span>&gt;
&lt;<span class="org-function-name">li</span>&gt;&lt;<span class="org-function-name">a</span> <span class="org-variable-name">href</span>=<span class="org-string">"#sec-1"</span>&gt;1 Introduction&lt;/<span class="org-function-name">a</span>&gt;
&lt;<span class="org-function-name">ul</span>&gt;
&lt;<span class="org-function-name">li</span>&gt;&lt;<span class="org-function-name">a</span> <span class="org-variable-name">href</span>=<span class="org-string">"#sec-1-1"</span>&gt;1.1 Conventions in this article&lt;/<span class="org-function-name">a</span>&gt;&lt;/<span class="org-function-name">li</span>&gt;
&lt;<span class="org-function-name">li</span>&gt;&lt;<span class="org-function-name">a</span> <span class="org-variable-name">href</span>=<span class="org-string">"#id-core"</span>&gt;1.2 ID management&lt;/<span class="org-function-name">a</span>&gt;&lt;/<span class="org-function-name">li</span>&gt;
&lt;/<span class="org-function-name">ul</span>&gt;
&lt;/<span class="org-function-name">li</span>&gt;
&lt;<span class="org-function-name">li</span>&gt;&lt;<span class="org-function-name">a</span> <span class="org-variable-name">href</span>=<span class="org-string">"#sec-2"</span>&gt;2 Service Components Layout&lt;/<span class="org-function-name">a</span>&gt;
&lt;<span class="org-function-name">ul</span>&gt;
&lt;<span class="org-function-name">li</span>&gt;&lt;<span class="org-function-name">a</span> <span class="org-variable-name">href</span>=<span class="org-string">"#sec-2-1"</span>&gt;2.1 Permanent Cluster&lt;/<span class="org-function-name">a</span>&gt;&lt;/<span class="org-function-name">li</span>&gt;
&lt;<span class="org-function-name">li</span>&gt;&lt;<span class="org-function-name">a</span> <span class="org-variable-name">href</span>=<span class="org-string">"#sec-2-2"</span>&gt;2.2 Caching Cluster&lt;/<span class="org-function-name">a</span>&gt;&lt;/<span class="org-function-name">li</span>&gt;
&lt;/<span class="org-function-name">ul</span>&gt;
&lt;/<span class="org-function-name">ul</span>&gt;
&lt;/<span class="org-function-name">div</span>&gt;
&lt;/<span class="org-function-name">div</span>&gt;
</pre>


<p>
    As you can see, all hyperlink IDs are in the form of <code>sec-N-M</code>, so
    it can be easily extracted with the following regular expression:
</p>



<pre class="src src-ruby"><span class="org-string">/^ *&lt;li&gt; *&lt;a +href *= *"(#sec-[0-9]+)" *&gt;(.*?)&lt;\/a&gt;/</span>
</pre>


<p>
    So, I made a <i>Jekyll</i> plugin, which parses the org-generated HTML file,
    and put the metadata of the each top-level headings in the <i>Jekyll</i> context,
    so that the <i>Jekyll</i> layout pages can take benefits from the context:
</p>



<pre class="src src-ruby"><span class="org-keyword">module</span> <span class="org-type">Jekyll</span>
  <span class="org-keyword">class</span> <span class="org-type">OrgToc</span> &lt; <span class="org-type">Liquid</span>::<span class="org-type">Block</span>
    ...
    <span class="org-keyword">def</span> <span class="org-function-name">render</span>(context)
      contents = context[<span class="org-string">'page'</span>][<span class="org-string">'content'</span>]

      thetoc = []

      contents.each_line { |line|
        m = <span class="org-string">/^ *&lt;li&gt; *&lt;a +href *= *"(#sec-[0-9]+)" *&gt;(.*?)&lt;\/a&gt;/</span>.match line
        <span class="org-keyword">if</span> m
          thetoc.push( { <span class="org-string">"id"</span> =&gt; m[1], <span class="org-string">"title"</span> =&gt; m[2] })
        <span class="org-keyword">end</span>

        <span class="org-keyword">break</span> <span class="org-keyword">if</span> <span class="org-string">/ *&lt;div +id *= *"outline-container-[0-9]+\"/</span>.match line
      }

      context[<span class="org-string">'page'</span>][<span class="org-string">'orgtoc'</span>] = thetoc

      <span class="org-keyword">super</span>
    <span class="org-keyword">end</span>
    ...
  <span class="org-keyword">end</span>
<span class="org-keyword">end</span>

<span class="org-type">Liquid</span>::<span class="org-type">Template</span>.register_tag(<span class="org-string">'orgtoc'</span>, <span class="org-type">Jekyll</span>::<span class="org-type">OrgToc</span>)
</pre>


<p>
    Then, the <i>Jekyll</i> layout for org HTML files will uses <code>page.orgtoc</code> to
    generate <i>scaffolding</i> TOC:
</p>





<pre class="src src-html">&lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"span3 bs-doc-sidebar"</span>&gt;
  &lt;<span class="org-function-name">ul</span> <span class="org-variable-name">class</span>=<span class="org-string">"nav nav-list bs-docs-sidenav"</span>&gt;
  {% orgtoc %}
    {% for item in page.orgtoc %}
      &lt;<span class="org-function-name">li</span>&gt;&lt;<span class="org-function-name">a</span> <span class="org-variable-name">href</span>=<span class="org-string">"{{item.id}}"</span>&gt;&lt;<span class="org-function-name">i</span> <span class="org-variable-name">class</span>=<span class="org-string">"icon-chevron-right"</span>&gt;&lt;/<span class="org-function-name">i</span>&gt;
      {{ item.title }}&lt;/<span class="org-function-name">a</span>&gt;&lt;/<span class="org-function-name">li</span>&gt;
    {% endfor %}
  {% endorgtoc %}
  &lt;/<span class="org-function-name">ul</span>&gt;
&lt;/<span class="org-function-name">div</span>&gt;
</pre>





</div>
